# 转换模式分两种：“清朝年号转公元纪年”、“公元纪年转清朝年号”
# 在第二种模式下，年号函数可不输入。
def 清朝年号和公元纪年转换(年份,转换模式,年号):
    if 转换模式=="清朝年号转公元纪年":
        if 年号=="天命":
            公元纪年=1616+年份-1
            if 公元纪年>1627:
                print("输入错误。")
            elif 公元纪年==1616:
                print("天命元年是公元",公元纪年,"年。")
            else:
                print("天命",年份,"年是公元",公元纪年,"年。")
        elif 年号=="天聪":
            公元纪年=1627+年份-1
            if 公元纪年>1636:
                print("输入错误。")
            elif 公元纪年==1627:
                print("天聪元年是公元",公元纪年,"年。")
            else:
                print("天聪",年份,"年是公元",公元纪年,"年。")
        elif 年号=="崇德":
            公元纪年=1636+年份-1
            if 公元纪年>1644:
                print("输入错误。")
            elif 公元纪年==1636:
                print("崇德元年是公元",公元纪年,"年。")
            else:
                print("崇德",年份,"年是公元",公元纪年,"年。")
        elif 年号=="顺治":
            公元纪年=1644+年份-1
            if 公元纪年>1662:
                print("输入错误。")
            elif 公元纪年==1662:
                print("顺治元年是公元",公元纪年,"年。")
            else:
                print("顺治",年份,"年是公元",公元纪年,"年。")
        elif 年号=="康熙":
            公元纪年=1662+年份-1
            if 公元纪年>1723:
                print("输入错误。")
            elif 公元纪年==1662:
                print("康熙元年是公元",公元纪年,"年。")
            else:
                print("康熙",年份,"年是公元",公元纪年,"年。")
        elif 年号=="雍正":
            公元纪年=1723+年份-1
            if 公元纪年>1736:
                print("输入错误。")
            elif 公元纪年==1723:
                print("雍正元年是公元",公元纪年,"年。")
            else:
                print("雍正",年份,"年是公元",公元纪年,"年。")
        elif 年号=="乾隆":
            公元纪年=1736+年份-1
            if 公元纪年>1796:
                print("输入错误。")
            elif 公元纪年==1736:
                print("乾隆元年是公元",公元纪年,"年。")
            else:
                print("乾隆",年份,"年是公元",公元纪年,"年。")
        elif 年号=="嘉庆":
            公元纪年=1796+年份-1
            if 公元纪年>1821:
                print("输入错误。")
            elif 公元纪年==1796:
                print("嘉庆元年是公元",公元纪年,"年。")
            else:
                print("嘉庆",年份,"年是公元",公元纪年,"年。")
        elif 年号=="道光":
            公元纪年=1821+年份-1
            if 公元纪年>1851:
                print("输入错误。")
            elif 公元纪年==1821:
                print("道光元年是公元",公元纪年,"年。")
            else:
                print("道光",年份,"年是公元",公元纪年,"年。")
        elif 年号=="咸丰":
            公元纪年=1851+年份-1
            if 公元纪年>1862:
                print("输入错误。")
            elif 公元纪年==1851:
                print("咸丰元年是公元",公元纪年,"年。")
            else:
                print("咸丰",年份,"年是公元",公元纪年,"年。")
        elif 年号=="同治":
            公元纪年=1862+年份-1
            if 公元纪年>1875:
                print("输入错误。")
            elif 公元纪年==1862:
                print("同治元年是公元",年份,"年。")
            else:
                print("同治",年份,"年是公元",公元纪年,"年。")
        elif 年号=="光绪":
            公元纪年=1875+年份-1
            if 公元纪年>1909:
                print("输入错误。")
            elif 公元纪年==1875:
                print("光绪元年是公元",公元年份,"年。")
            else:
                print("光绪",年份,"年是公元",公元纪年,"年。")
        elif 年号=="宣统":
            公元纪年=1909+年份-1
            if 公元纪年>1912:
                print("输入错误。")
            elif 公元纪年==1909:
                print("宣统元年是公元",公元纪年,"年。")
            else:
                print("宣统",年份,"年是公元",公元纪年,"年。")
        else:
            print("输入错误。")
    elif 转换模式=="公元纪年转清朝年号":
        if 年份>=1616 and 年份<=1627:
            清朝纪年=年份-1616
            if 清朝纪年==0:
                print("公元",年份,"年是天命元年。")
            else:
                print("公元",年份,"年是天命",清朝纪年+1,"年。")
        elif 年份>=1627 and 年份<=1636:
            清朝纪年=年份-1627
            if 清朝纪年==0:
                print("公元",年份,"年是天聪元年。")
            else:
                print("公元",年份,"年是天聪",清朝纪年+1,"年。")
        elif 年份>=1636 and 年份<=1644:
            清朝纪年=年份-1636
            if 清朝纪年==0:
                print("公元",年份,"年是崇德元年。")
            else:
                print("公元",年份,"年是崇德",清朝纪年+1,"年。")
        elif 年份>=1644 and 年份<=1662:
            清朝纪年=年份-1644
            if 清朝纪年==0:
                print("公元",年份,"年是顺治元年。")
            else:
                print("公元",年份,"年是顺治",清朝纪年+1,"年。")
        elif 年份>=1662 and 年份<=1723:
            清朝纪年=年份-1662
            if 清朝纪年==0:
                print("公元",年份,"年是康熙元年。")
            else:
                print("公元",年份,"年是康熙",清朝纪年+1,"年。")
        elif 年份>=1723 and 年份<=1736:
            清朝纪年=年份-1723
            if 清朝纪年==0:
                print("公元",年份,"年是雍正元年。")
            else:
                print("公元",年份,"年是雍正",清朝纪年+1,"年。")
        elif 年份>=1736 and 年份<=1796:
            清朝纪年=年份-1736
            if 清朝纪年==0:
                print("公元",年份,"年是乾隆元年。")
            else:
                print("公元",年份,"年是乾隆",清朝纪年+1,"年。")
        elif 年份>=1796 and 年份<=1821:
            清朝纪年=年份-1796
            if 清朝纪年==0:
                print("公元",年份,"年是嘉庆元年。")
            else:
                print("公元",年份,"年是嘉庆",清朝纪年+1,"年。")
        elif 年份>=1821 and 年份<=1851:
            清朝纪年=年份-1821
            if 清朝纪年==0:
                print("公元",年份,"年是道光元年。")
            else:
                print("公元",年份,"年是道光",清朝纪年,"年。")
        elif 年份>=1851 and 年份<=1862:
            清朝纪年=年份-1851
            if 清朝纪年==0:
                print("公元",年份,"年是咸丰元年。")
            else:
                print("公元",年份,"年是咸丰",清朝纪年+1,"年。")
        elif 年份>=1862 and 年份<=1875:
            清朝纪年=年份-1862
            if 清朝纪年==0:
                print("公元",年份,"年是同治元年。")
            else:
                print("公元",年份,"年是同治",清朝纪年+1,"年。")
        elif 年份>=1875 and 年份<=1909:
            清朝纪年=年份-1875
            if 清朝纪年==0:
                print("公元",年份,"年是光绪元年。")
            else:
                print("公元",年份,"年是光绪",清朝纪年,"年。")
        elif 年份>=1909 and 年份<=1912:
            清朝纪年=年份-1909
            if 清朝纪年==0:
                print("公元",年份,"年是宣统元年。")
            else:
                print("公元",年份,"年是宣统",清朝纪年,"年。")
        else:
            print("输入错误。")
    else:
        print("输入错误。")